<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Amazon Drive and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.clburlison.munki.AmazonCloudDrive</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Amazon Drive</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/amazon</string>
		<key>NAME</key>
		<string>AmazonCloudDrive</string>
		<key>DEVELOPER</key>
		<string>amazon</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Amazon Drive is your place for everything digital. Cloud Drive offers free mobile apps, secure access from any computer, and it's built in to your Amazon devices—so you can access your digital content everywhere you are.</string>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>display_name</key>
			<string>Amazon Drive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>preinstall_script</key>
<string>#!/bin/bash
OLD_APP="/Applications/Amazon Cloud Drive App.app"
if [ -d "$OLD_APP" ]
then
/bin/rm -Rf "$OLD_APP"
fi
</string>
			<key>blocking_applications</key>
			<array>
					<string>Amazon Cloud Drive App</string>
					<string>Amazon Cloud</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.clburlison.download.AmazonCloudDrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
