<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0 (https://github.com/homebysix/recipe-robot)
GITHUB_ARCH is either Arm64 or X86
	</string>
	<key>Description</key>
	<string>Downloads the latest version of Angry IP Scanner.</string>
	<key>Identifier</key>
	<string>com.github.clburlison.download.AngryIPScanner</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>angryip/ipscan</string>
		<key>GITHUB_ARCH</key>
		<string>Arm64</string>
		<key>NAME</key>
		<string>Angry IP Scanner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>ipscan-mac%GITHUB_ARCH%-.+.zip</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
